---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.CustomFieldNecessaryIdDeleted
source: html/73cf6bb9-4b9e-7527-27c7-cc27cfdf68ca.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.CustomFieldNecessaryIdDeleted Property

An element that is needed to compute the field [field name] from [schedule name] schedule was deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId CustomFieldNecessaryIdDeleted { get; }
```